#Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
#Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. 
#Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа
s = int(input("Введите сумму: "))
p = int(input("Введите произведение: "))
# x*y=p
# x+y=s
# p/x=y
# s-x=y
i = 1
count = 0
while s > p:
    print("Сумма превышает произведение!")
    s = int(input("Введите сумму: "))
    p = int(input("Введите произведение: "))
while count < 1:
    if s - i == p // i:
        count += 1
        print(i, s - i)
    else:
        i += 1